In [71]:
#imports
import json
import pandas as pd
import numpy as np
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [72]:
#upload data of combined tmdb/movie data from part 2
df = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)

In [73]:
#also upload basics and ratings data, do not need akas data

#open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1907
1  tt0000002            5.8       256
2  tt0000003            6.5      1706
3  tt0000004            5.6       168
4  tt0000005            6.2      2520

In [74]:
#open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016.0,NaN,74,Comedy

In [75]:
#review data
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.000,0.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.108,1956.0,PG

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3442 entries, 0 to 3441
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                3442 non-null   object
 1   adult                  3440 non-null   float64
 2   backdrop_path          1804 non-null   object
 3   belongs_to_collection  256 non-null    object
 4   budget                 3440 non-null   float64
 5   genres                 3440 non-null   object
 6   homepage               258 non-null    object
 7   id                     3440 non-null   float64
 8   original_language      3440 non-null   object
 9   original_title         3440 non-null   object
 10  overview               3366 non-null   object
 11  popularity             3440 non-null   float64
 12  poster_path            3052 non-null   object
 13  production_companies   3440 non-null   object
 14  production_countries   3440 non-null   object
 15  release_date           3417 non-null   object
 16  revenue                3440 non-null   float64
 17  runtime                3440 non-null   float64
 18  spoken_languages       3440 non-null   object
 19  status                 3440 non-null   object
 20  tagline                1495 non-null   object
 21  title                  3440 non-null   object
 22  video                  3440 non-null   float64
 23  vote_average           3440 non-null   float64
 24  vote_count             3440 non-null   float64
 25  certification          1167 non-null   object
dtypes: float64(9), object(17)
memory usage: 699.3+ KB

In [77]:
#confirm correct file with years 2000 and 20001
df['release_date'].value_counts()

2001-01-01    210
2000-01-01    127
2001-09-07     27
2001-08-01     25
2001-09-28     23
             ...
2000-07-11      1
2000-01-09      1
2000-02-15      1
2000-04-09      1
2001-06-16      1
Name: release_date, Length: 710, dtype: int64

In [78]:
#only need imdb_id, revenue, budget, and certification columns
df = df[['imdb_id', 'revenue', 'budget', 'certification']]

In [79]:
#confirm columns
df.head()

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

In [80]:
#convert genres column from basics data to 2 new tables; 
    #title_genres with columns tconst and genre_id
    #genres with columns genre_id and genre_name

#create list of individual genres
    #create a column with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016.0,NaN,74,Comedy,[Comedy]
...,...,...,...,...,...,...,...,...,...,...
84706,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019.0,NaN,74,Drama,[Drama]
84707,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
84708,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama,[Drama]
84709,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
84710,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History","[Drama, History]"

In [81]:
    #use .explode() to separate list of genres- one row for each genre a movie belongs to
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
84709,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Action
84709,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
84709,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
84710,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",Drama
84710,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History",History

In [82]:
    #use .unique() to get unique genres from the genres_split column
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [83]:
#Create a new title_genres table with with the movie ids duplicated, once for each genre that a movie belongs to.

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [84]:
#Create a genre mapper dictionary with numeric ids for each genre.

## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [85]:
#Use the mapper dictionary to replace the string genres in title_genres with numeric genre_ids.

title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
84709  tt9916190         0
84709  tt9916190         2
84709  tt9916190        23
84710  tt9916362         7
84710  tt9916362        11

[157656 rows x 2 columns]

In [86]:
#Convert the mapper dictionary into a final genres table with the numeric genre_id and the string genre.

    #manually make dataframe with named columns from the .keyd and .values
genres = pd.DataFrame({'Genre_Name': genre_map.keys(),
                             'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [87]:
#from basics, drop original_title, isAdult, titleType, genres and genres variants.
basics = basics.drop(columns = ['originalTitle', 'isAdult', 'titleType', 'genres', 'genres_split'], axis = 1)
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,NaN,70
2,tt0069049,The Other Side of the Wind,2018.0,NaN,122
3,tt0088751,The Naked Monster,2005.0,NaN,100
4,tt0094859,Chief Zabu,2016.0,NaN,74

In [88]:
#connect to MySQL

#Use SQL alchemy in python to convert data into MySQL database in python.
with open('/Users/abate/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['user', 'password'])

In [89]:
#connect 
connection = "mysql+pymysql://root:root@localhost/project3"

In [90]:
#confirm connection location
engine = create_engine(connection)
engine

Engine(mysql+pymysql://root:***@localhost/project3)

In [91]:
#prompt to create database if it does not already exist
if database_exists(connection):
    print('It exists')
else: 
    create_database(connection)
    print('Database created')

It exists

In [92]:
#set tconst as the primary key

#tconst is a string column, need to create datatype schema for to_sql
    #check dtypes- create dictionary with each column as a key to SQL datatype value
    #run df.to_sql with dtype argument with index=False
    #run query to add primary key
#show the first 5 rows of each table using a SQL query

from sqlalchemy.types import *

key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [93]:
 #save to_sql with dtype argument with index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

84711

In [94]:
#run query to add primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [95]:
#sql table
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0094859,Chief Zabu,2016.0,None,74

In [96]:
#ratings
key_len2 = ratings['tconst'].fillna('').map(len).max()
ratings_schema = {
    "tconst": String(key_len2+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [97]:
#save to_sql with dtype argument with index=False
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',index=False)

1258095

In [98]:
#show sql table
q = """SELECT * FROM ratings LIMIT 5;"""
pd.read_sql(q, engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      1907
1      1  tt0000002            5.8       256
2      2  tt0000003            6.5      1706
3      3  tt0000004            5.6       168
4      4  tt0000005            6.2      2520

In [99]:
#title_genres
key_len3 = genres['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "imdb_id": String(key_len+1), 
    "Genre_ID": Integer()}

In [100]:
#save to_sql with dtype argument with index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',index=False)

26

In [101]:
#show table
q = """SELECT * FROM genres LIMIT 5;"""
pd.read_sql(q, engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3442 entries, 0 to 3441
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        3442 non-null   object
 1   revenue        3440 non-null   float64
 2   budget         3440 non-null   float64
 3   certification  1167 non-null   object
dtypes: float64(2), object(2)
memory usage: 107.7+ KB

In [103]:
#df/movie df
key_len4 = df['imdb_id'].fillna('').map(len).max()
title_len = df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": String(key_len+1), 
    'revenue':Float(),
    'budget':Float(),
    "certification": Text(title_len+1)}

In [104]:
#save to_sql with dtype argument with index=False
df.to_sql('df',engine,dtype=df_schema,if_exists='replace',index=False)

3442

In [105]:
#show table
q = """SELECT * FROM df LIMIT 5;"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0116391         0.0         0.0          None
4  tt0118694  12855000.0    150000.0            PG

In [106]:
#title_genres
key_len5 = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    "genres_id": Integer()}

In [107]:
#save to_sql with dtype argument with index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',index=False)

157656

In [108]:
#show table
q = """SELECT * FROM title_genres LIMIT 5;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7